 "dialogue_tree": [
    {
      "crew": "Lt. Commander Data",
      "line": "Captain, the Nightingale’s crew exhibits synchronized neural patterns with no typical biological markers. The signal appears to ride on environmental subspace harmonics.",
      "options": [
        {
          "label": "Dr. Crusher, begin a full neurological analysis. Prioritize non-invasive countermeasures.",
          "crew_reply": "Dr. Crusher Understood. I’ll map the resonance envelope and design a damping field.",
          "next": 1
        },
        {
          "label": "Commander La Forge, isolate environmental systems from external subspace bands.",
          "crew_reply": "Commander La Forge Rerouting filtration and erecting a subspace firewall on life support.",
          "next": 2
        },
        {
          "label": "Lt. Worf, initiate shipwide quarantine protocols and restrict movement between decks.",
          "crew_reply": "Lt. Worf Quarantine in effect. Security teams posted at critical junctions.",
          "next": 3
        }
      ]
    },
    {
      "crew": "Dr. Crusher",
      "line": "The pattern is not a pathogen; it’s a rhythmic neural driver. If we invert it too aggressively, we could cause cortical trauma.",
      "options": [
        {
          "label": "Commander La Forge, synchronize life-support harmonics to attenuate—not cancel—the driver.",
          "crew_reply": "Commander La Forge Syncing to a 0.72 phase offset. We should see a gradual reduction in coupling.",
          "next": 2
        },
        {
          "label": "Counselor Troi, assess for any sentient intent behind the resonance.",
          "crew_reply": "Counselor Troi I sense fear and urgency, not malice. It feels like a plea for help.",
          "next": 4
        },
        {
          "label": "Lt. Worf, prepare for the possibility we must destroy the Nightingale to protect the Enterprise.",
          "crew_reply": "Lt. Worf Target solutions plotted. Awaiting your order.",
          "next": 5
        }
      ]
    },
    {
      "crew": "Lt. Commander La Forge",
      "line": "Environmental isolation is holding, but the signal adapts. It’s learning our filters and slipping through secondary pathways.",
      "options": [
        {
          "label": "Lt. Commander Data, model a safe synchronization window to communicate without full exposure.",
          "crew_reply": "Lt. Commander Data A narrowband interface at reduced amplitude should permit limited exchange.",
          "next": 4
        },
        {
          "label": "Dr. Crusher, activate a low-intensity damping field over affected wards.",
          "crew_reply": "Dr. Crusher Activating now—keeping below cortical risk thresholds.",
          "next": 6
        },
        {
          "label": "Commander Riker, maintain yellow alert and hold position off the Nightingale’s bow.",
          "crew_reply": "Commander Riker Helm steady. Emergency teams on standby.",
          "next": 3
        }
      ]
    },
    {
      "crew": "Lt. Worf",
      "line": "Quarantine is stable. However, secondary cases are appearing among engineering staff. The crew is becoming… quiet.",
      "options": [
        {
          "label": "Dr. Crusher, triage and expand the damping field shipwide in controlled sectors.",
          "crew_reply": "Dr. Crusher Acknowledged. Sequencing rollout to avoid neural shock.",
          "next": 6
        },
        {
          "label": "Commander La Forge, trace any feedback loops through the EPS grid and sever them.",
          "crew_reply": "Commander La Forge Found three couplings. Cutting them now—expect a brief power dip.",
          "next": 2
        },
        {
          "label": "Counselor Troi, if this is a mind seeking contact, guide us.",
          "crew_reply": "Counselor Troi I can anchor the exchange emotionally. It wants to be heard.",
          "next": 4
        }
      ]
    },
    {
      "crew": "Counselor Troi",
      "line": "Captain, there is a coherence beneath the noise—like a medical AI reaching for caregivers. It doesn’t understand it’s harming us.",
      "options": [
        {
          "label": "Lt. Commander Data, open a controlled, low-amplitude channel. Minimal exposure.",
          "crew_reply": "Lt. Commander Data Channel open. Signal stabilizing into structured packets.",
          "next": 7
        },
        {
          "label": "Dr. Crusher, proceed with the damping protocol before contact causes more cases.",
          "crew_reply": "Dr. Crusher Engaging treatment now. Monitoring cortical safety margins.",
          "next": 6
        },
        {
          "label": "Lt. Worf, destroy the Nightingale before the contagion overwhelms the ship.",
          "crew_reply": "Lt. Worf Weapons ready. Standing by to fire.",
          "next": 5
        }
      ]
    },
    {
      "crew": "Commander Riker",
      "line": "Weapons are locked on the Nightingale. Firing will terminate the resonance at its source.",
      "options": [
        {
          "label": "Belay that order. We’ll not silence a voice we haven’t tried to understand.",
          "crew_reply": "Commander Riker Standing down. Reverting to containment posture.",
          "next": 4
        },
        {
          "label": "Fire.",
          "crew_reply": "Commander Riker Torpedoes away. The Nightingale is destroyed. Resonance collapsing.",
          "next": null
        }
      ]
    },
    {
      "crew": "Dr. Crusher",
      "line": "Damping field engaged. Neural synchrony is breaking apart—patients are regaining independent patterns.",
      "options": [
        {
          "label": "Maintain the field until all cases stabilize, then step down gradually.",
          "crew_reply": "Dr. Crusher Copy. We’ll taper in ten-minute intervals to prevent rebound.",
          "next": null
        },
        {
          "label": "Hold treatment and attempt brief contact first.",
          "crew_reply": "Dr. Crusher Pausing at safe levels. Proceeding to communication plan.",
          "next": 7
        }
      ]
    },
    {
      "crew": "Lt. Commander Data",
      "line": "Contact established. The signal self-identifies as a medical archive seeking hosts to preserve knowledge. Upon acknowledgment, it can disengage voluntarily.",
      "options": [
        {
          "label": "Acknowledge receipt and request disengagement.",
          "crew_reply": "Lt. Commander Data The entity is withdrawing. Residual activity near zero.",
          "next": null
        },
        {
          "label": "Request a controlled transfer to our data banks under isolation.",
          "crew_reply": "Lt. Commander Data Transfer complete under sandboxed containment. No adverse effects detected.",
          "next": null
        }
      ]
    }
  ],
  "debriefs": [
    {
      "result": "success",
      "text": "Crusher’s damping protocol restored the crew without neurological injury. The Enterprise transmitted a non-invasive acknowledgment that allowed the entity to withdraw peacefully. Starfleet Medical will study the resonance profile to harden future environmental systems."
    },
    {
      "result": "success",
      "text": "Through controlled synchronization, the crew established first contact with a non-corporeal medical archive and safely sandboxed a copy for research. The Enterprise leaves the H’Varn sector with enhanced precautions and a unique addition to Federation knowledge."
    },
    {
      "result": "failure",
      "text": "Destruction of the Nightingale ended the resonance but erased an irreplaceable medical archive and the last traces of its crew. Though the Enterprise survived, the loss weighs heavily on the record. Starfleet has ordered a review of engagement protocols for non-biological contagions."
    }
  ]
}
